app/controllers/blog_controller.rb

    def load
        @contact = Contact.new
        @articles = Article.all.reverse_order
        @projects = Project.all
---
SELECT `articles`.* FROM `articles` ORDER BY `articles`.`id` DESC
SELECT `projects`.* FROM `projects`