app/controllers/contacts_controller.rb

    def new
        @contact = Contact.new
        @projects = Project.all
---
SELECT `projects`.* FROM `projects`