app/controllers/home_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    @contact = Contact.new
    @articles = Article.all.reverse_order
    @projects = Project.all