app/controllers/project_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`kind` = 'Software'
---
  def load_art
	@projects = Project.where(kind: "Art")

INSERT INTO `projects` (`title`, `kind`, `link`, `content_hash`, `content_type`, `content_length`, `filename`, `created_at`, `updated_at`) VALUES ('test', 'Software', 'https://test', '58c098097708eea3032aecc936d3b3469741c97c', 'image/jpeg', 25980, 'TechnoAge.jpg', '2017-08-20 13:54:20', '2017-08-20 13:54:20')
---
  def create
  	@project = Project.new(project_params)

    if @project.save

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
---
  def edit
		@project = Project.find(params[:id])

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 4 LIMIT 1
UPDATE `projects` SET `image` = 'TechnoQuote1.jpg', `updated_at` = '2017-08-20 16:50:30' WHERE `projects`.`id` = 2
---
  def update
  	@project = Project.find(params[:id])
    if @project.update_attributes(project_params)

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 4 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 4
---
  def delete
    @project = Project.find(params[:id])
    @project.destroy