app/controllers/session_controller.rb

	def authenticate
	    user = User.find_by_name(params[:name])
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'admin' LIMIT 1