app/controllers/thoughts_controller.rb

SELECT `thoughts`.* FROM `thoughts` ORDER BY `thoughts`.`publish_date` DESC
---
  def load_all
    @thoughts = Thought.all.order(publish_date: :desc)

SELECT  `thoughts`.* FROM `thoughts` WHERE `thoughts`.`id` = 4 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`thought_id` = 4 ORDER BY `comments`.`publish_date` DESC
---
  def load_post
    @thought  = Thought.find(params[:id])
	@comments = Comment.where(thought_id: params[:id]).order(publish_date: :desc)

DELETE FROM `tags_thoughts` WHERE `tags_thoughts`.`thought_id` = 4
DELETE FROM `thoughts` WHERE `thoughts`.`id` = 4
---
  def destroy_thought
    @thought = Thought.find(params[:id])
    @thought.destroy

INSERT INTO `comments` (`author`, `publish_date`, `content`, `thought_id`, `created_at`, `updated_at`) VALUES ('tesh', '2017-08-04 03:58:01', 'adsfl', 4, '2017-08-04 03:58:01', '2017-08-04 03:58:01')
---
  def create_comment
	@comment = Comment.new()
	@comment.author = params[:author]
	@comment.content = params[:content]
	@comment.publish_date = DateTime.now
	@comment.thought_id = params[:id]
	if @comment.save

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy_comment
    @comment = Comment.find(params[:cid])
    @comment.destroy